Page({
  data: {
    //默认滚动栏的可视数据
    multiArray: [
      ['区域', '地铁'],
      ['罗湖区', '福田区', '南山区', '盐田区', '宝安区', '龙岗区', '龙华区', '光明区', '坪山区', '大鹏新区'],
      ['布心', '百仕达', '翠竹', '春风路', '地王', '东门', '黄贝岭', '洪湖', '黄木岗', '莲塘', '罗湖口岸', '螺岭', '清水河', '笋岗', '万象城', '新秀', '银湖']
    ],
    //被选择的每一个列的序列号的初始值（从0开始）（列：（0，3，1）现在被选的是第1列第1行数据，第2列第4行数据，第3列第2行数据）
    multiIndex: [0, 0, 0],

    //地区换名
    multiName: "地区",

    //价格与房型的默认选项
    index: 0,
    //价格
    moneyArray: ['不限', '1000以下', '1000-1500元', '1500-2000元', '2000-3000元', '3000-5000元', '5000-8000元', '8000以上'],
    //房型
    household_type_array: ['单房', '一房一厅', '两房一厅'],
  },

  bindMultiPickerColumnChange: function (e) {
    console.log('修改的列为', e.detail.column, '，值为', e.detail.value);
    var data = {
      multiArray: this.data.multiArray,
      multiIndex: this.data.multiIndex
    };
    //e.detail.column 是列 , data.multiIndex[0]是第1行
    data.multiIndex[e.detail.column] = e.detail.value;
    //每次选择后都会重新刷新整个滚动条
    switch (e.detail.column) {
      /**
       * 修改第一列的时候需要修改两列数据，修改第二列的时候需要修改一列数据。
       * 修改第1列的时候，就更改第2和第3列的数据，
       * 修改第2列的时候，就更改第3列的数据
       * 修改第3列的时候不需要修改别的数据
       */
      //修改第1列的时候
      case 0:
        //判断选择的值在第一列的哪一行
        switch (data.multiIndex[0]) {
          case 0:
            data.multiArray[1] = ['罗湖区', '福田区', '南山区', '盐田区', '宝安区', '龙岗区', '龙华区', '光明区', '坪山区', '大鹏新区'];
            //选择第二列后默认显示的第三列数据
            data.multiArray[2] = ['布心', '百仕达', '翠竹', '春风路', '地王', '东门', '黄贝岭', '洪湖', '黄木岗', '莲塘', '罗湖口岸', '螺岭', '清水河', '笋岗', '万象城', '新秀', '银湖'];
            break;
          case 1:
            data.multiArray[1] = ['1号线(罗宝线)', '2号线(蛇口线)', '3号线(龙岗线)', '4号线(龙华线)', '5号线(环中线)', '6号线', '7号线', '8号线', '9号线', '10号线', '11号线'];
            //选择第二列后默认显示的第三列数据
            data.multiArray[2] = ['罗湖', '国贸', '老街', '大剧院', '科学馆', '华强路', '岗厦', '会展中心', '购物公园', '香蜜湖', '车公庙', '竹子林', '侨城东', '华侨城', '世界之窗', '白石洲', '高新园', '深大', '桃园', '大新', '鲤鱼门', '前海湾', '新安', '宝安中心', '宝体', '坪洲', '西乡', '固戍', '后瑞', '机场东'];
            break;
        }
        //修改第一列的时候第二列和第三列的数据默认为第一行
        data.multiIndex[1] = 0;
        data.multiIndex[2] = 0;
        break;
        //修改第2列的时候
      case 1:
        //判断选择的值在第一列的哪一行
        switch (data.multiIndex[0]) {
          case 0:
            //判断选择的值在第二列的哪一行
            switch (data.multiIndex[1]) {
              case 0:
                data.multiArray[2] = ['布心', '百仕达', '翠竹', '春风路', '地王', '东门', '黄贝岭', '洪湖', '黄木岗', '莲塘', '罗湖口岸', '螺岭', '清水河', '笋岗', '万象城', '新秀', '银湖'];
                break;
              case 1:
                data.multiArray[2] = ['八卦岭', '百花', '车公庙', '赤尾', '福田中心', '福田保税区', '皇岗', '华强南', '华强北', '黄木岗', '景田', '莲花', '梅林', '上步', '石厦', '上下沙', '沙尾', '香蜜湖', '新洲', '香梅北', '银湖', '园岭', '竹子林'];
                break;
              case 2:
                data.multiArray[2] = ['白石洲', '大学城', '红树湾', '华侨城', '后海', '科技园', '南山中心', '南头', '前海', '蛇口', '深圳湾', '西丽'];
                break;
              case 3:
                data.multiArray[2] = ['梅沙', '沙头角', '盐田港'];
                break;
              case 4:
                data.multiArray[2] = ['宝安中心', '碧海', '福永', '翻身', '石岩', '松岗', '沙井', '桃源居', '西乡', '新安', '曦城'];
                break;
              case 5:
                data.multiArray[2] = ['坂田', '布吉街', '布吉南岭', '布吉关', '布吉大芬', '布吉水径', '布吉石芽岭', '大运新城', '丹竹头', '横岗', '龙岗双龙', '龙岗中心城', '龙岗宝荷', '民治', '坪地', '平湖'];
                break;
              case 6:
                data.multiArray[2] = ['坂田', '观澜', '红山', '龙华中心', '龙华新区', '梅林关', '石岩', '上塘'];
                break;
              case 7:
                data.multiArray[2] = ['公明', '桃源居'];
                break;
              case 8:
                data.multiArray[2] = ['坪山'];
                break;
              case 9:
                data.multiArray[2] = ['大鹏半岛'];
                break;
            }
            break;
          case 1:
            switch (data.multiIndex[1]) {
              case 0:
                data.multiArray[2] = ['罗湖', '国贸', '老街', '大剧院', '科学馆', '华强路', '岗厦', '会展中心', '购物公园', '香蜜湖', '车公庙', '竹子林', '侨城东', '华侨城', '世界之窗', '白石洲', '高新园', '深大', '桃园', '大新', '鲤鱼门', '前海湾', '新安', '宝安中心', '宝体', '坪洲', '西乡', '固戍', '后瑞', '机场东'];
                break;
              case 1:
                data.multiArray[2] = ['新秀', '黄贝岭', '湖贝', '大剧院', '燕南', '华强北', '岗厦北', '市民中心', '福田', '莲花西', '景田', '香梅北', '香蜜', '侨香', '安托山', '深康', '侨城北', '世界之窗', '红树湾', '科苑', '后海', '登良', '海月', '湾厦', '东角头', '水湾', '海上世界', '蛇口港', '赤湾', '莲塘'];
                break;
              case 2:
                data.multiArray[2] = ['益田', '石厦', '购物公园', '福田', '少年宫', '莲花村', '华新', '通新岭', '红岭', '老街', '晒布', '翠竹', '田贝', '水贝', '草埔', '布吉', '木棉湾', '大芬', '丹竹头', '六约', '塘坑', '横岗', '永湖', '荷坳', '大运', '爱联', '吉祥', '龙城广场', '南联', '双龙'];
                break;
              case 3:
                data.multiArray[2] = ['福田口岸', '福民', '会展中心', '市民中心', '少年宫', '莲花北', '上梅林', '民乐', '白石龙', '深圳北站', '红山', '上塘', '龙胜', '龙华', '清湖', '清湖北', '竹村', '茜坑', '长湖', '观澜', '松元厦', '观澜湖', '牛湖'];
                break;
              case 4:
                data.multiArray[2] = ['赤湾', '荔湾', '铁路公园', '妈湾', '前湾公园', '前湾', '桂湾', '前海湾', '临海', '宝华', '宝安中心', '翻身', '灵芝', '洪浪北', '兴东', '留仙洞', '西丽', '大学城', '塘朗', '长岭陂', '深圳北站', '民治', '五和', '坂田', '杨美', '上水径', '下水径', '长龙', '布吉', '百鸽笼', '布心', '太安', '怡景', '黄贝岭'];
                break;
              case 5:
                data.multiArray[2] = ['公明广场', '松岗', '溪头', '松岗公园', '薯田埔', '合水口', '红花山', '楼村', '科学公园', '光明', '光明大街', '凤凰城', '长圳', '上屋', '官田', '阳台山东', '元芬', '上芬', '红山', '深圳北站', '梅林关', '翰岭', '银湖', '八卦岭', '体育中心', '通新岭', '科学馆'];
                break;
              case 6:
                data.multiArray[2] = ['西丽湖', '西丽', '茶光', '珠光', '龙井', '桃源村', '深云', '安托山', '农林', '车公庙', '上沙', '沙尾', '石厦', '皇岗村', '福民', '皇岗口岸', '赤尾', '华强南', '华强北', '华新', '黄木岗', '八卦岭', '红岭北', '笋岗', '洪湖', '田贝', '太安'];
                break;
              case 7:
                data.multiArray[2] = ['青蛙', '娃娃鱼'];
                break;
              case 8:
                data.multiArray[2] = ['莲塘', '梧桐山南', '沙头角', '海山', '深外高中', '盐田路'];
                break;
              case 9:
                data.multiArray[2] = ['前湾', '梦海', '怡海', '荔林', '南油西', '南油', '南山书城', '深大南', '粤海门', '高新南', '红树湾', '深圳湾公园', '下沙', '车公庙', '香梅', '景田', '梅景', '下梅林', '梅村', '上梅林', '孖岭', '银湖', '泥岗', '红岭北', '园岭', '红岭', '红岭南', '鹿丹村', '人民南', '向西村', '文锦'];
                break;
              case 10:
                data.multiArray[2] = ['双拥街', '平湖', '禾花', '华南城', '木古', '上李朗', '凉帽山', '甘坑', '雪象', '岗头', '华为', '贝尔路', '坂田北', '五和', '光雅园', '南坑', '雅宝', '孖岭', '冬瓜岭', '莲花村', '岗厦', '福民', '福田口岸'];
                break;
              case 11:
                data.multiArray[2] = ['碧头', '松岗', '后亭', '沙井', '马安山', '塘尾', '桥头', '福永', '机场北', '机场', '碧海湾', '宝安', '前海湾', '南山', '后海', '红树湾南', '车公庙', '福田'];
                break;
            }
            break;
        }
        //修改第二列的时候第三列的数据默认为第一行
        data.multiIndex[2] = 0;
        console.log(data.multiIndex);
        break;
    }
    this.setData(data);
    this.setData({
      multiName: '...' + data.multiArray[2][data.multiIndex[2]],
    });
  },
})